-- Решил: Егор Степанов <https://github.com/egorstepanovcl>

-- Название: 176. Вторая по величине зарплата (176. Second Highest Salary)

-- Задача:
-- Таблица: Employee
-- +-------------+------+
-- | Column Name | Type |
-- +-------------+------+
-- | id          | int  |
-- | salary      | int  |
-- +-------------+------+
-- id это первичный ключ (столбец с уникальными значениями) для данной таблицы.
-- Каждая строка этой таблицы содержит информацию о зарплате сотрудника.

-- Напишите решение для поиска второй по величине зарплаты из таблицы Employee. Если второй по величине зарплаты нет, верните null (return None в Pandas).
-- Формат результата приведен в следующем примере.

-- Пример 1:
-- Вход:
-- Employee таблица:
-- +----+--------+
-- | id | salary |
-- +----+--------+
-- | 1  | 100    |
-- | 2  | 200    |
-- | 3  | 300    |
-- +----+--------+
-- Выход: 
-- +---------------------+
-- | SecondHighestSalary |
-- +---------------------+
-- | 200                 |
-- +---------------------+

-- Пример 2:
-- Вход: 
-- Employee таблица:
-- +----+--------+
-- | id | salary |
-- +----+--------+
-- | 1  | 100    |
-- +----+--------+
-- Выход: 
-- +---------------------+
-- | SecondHighestSalary |
-- +---------------------+
-- | null                |
-- +---------------------+

SELECT 
    (SELECT DISTINCT salary 
     FROM Employee 
     ORDER BY salary DESC 
     LIMIT 1 OFFSET 1) AS SecondHighestSalary;